>Shitanshu Kusmakar (<strong><em> shitanshu.kusmakar@anz.com </em></strong>)

# Pandas: Data Manipulation

### Merging

When you want to combine data objects based on one or more keys in a similar way to a relational database, merge() is the tool you need. More specifically, merge() is most useful when you want to combine rows that share data.

Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL. Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects.

In [1]:
import pandas as pd

In [2]:
left = pd.DataFrame({
   'id':[1,2,4,6,7],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

In [3]:
left.head()

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   4   Allen       sub4
3   6   Alice       sub6
4   7  Ayoung       sub5

In [4]:
right = pd.DataFrame(
   {'id':[1,3,5,6,7],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [29]:
right.head()

   id   Name subject_id
0   1  Billy       sub2
1   3  Brian       sub4
2   5   Bran       sub3
3   6  Bryce       sub6
4   7  Betty       sub5

In [5]:
# The merge() function in Pandas is our friend here. By default, the merge function performs an inner join. 
print (pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   6   Alice         sub6  Bryce         sub6
2   7  Ayoung         sub5  Betty         sub5

In [6]:
print (pd.merge(left,right,on=['id','subject_id']))

   id  Name_x subject_id Name_y
0   6   Alice       sub6  Bryce
1   7  Ayoung       sub5  Betty

The how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or the right tables, the values in the joined table will be NA.

In [7]:
#Left Join
print (pd.merge(left, right, on='subject_id', how='left'))

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     4   Allen       sub4   3.0  Brian
3     6   Alice       sub6   6.0  Bryce
4     7  Ayoung       sub5   7.0  Betty

In [8]:
#Right Join
print (pd.merge(left, right, on='subject_id', how='right'))

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   4.0   Allen       sub4     3  Brian
2   6.0   Alice       sub6     6  Bryce
3   7.0  Ayoung       sub5     7  Betty
4   NaN     NaN       sub3     5   Bran

In [9]:
#Outer Join - Union
print (pd.merge(left, right, how='outer', on='subject_id'))

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   4.0   Allen       sub4   3.0  Brian
3   6.0   Alice       sub6   6.0  Bryce
4   7.0  Ayoung       sub5   7.0  Betty
5   NaN     NaN       sub3   5.0   Bran

In [10]:
#Inner Join - Intersection
print (pd.merge(left, right, on='subject_id', how='inner'))

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     4   Allen       sub4     3  Brian
2     6   Alice       sub6     6  Bryce
3     7  Ayoung       sub5     7  Betty

### Concatenation

Pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects.

In [11]:
import pandas as pd

In [15]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

In [16]:
one

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [17]:
two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [18]:
two

    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [19]:
print (pd.concat([one,two]))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [20]:
temp = pd.concat([one,two],keys=['x','y'])
print(temp)

       Name subject_id  Marks_scored
x 1    Alex       sub1            98
  2     Amy       sub2            90
  3   Allen       sub4            87
  4   Alice       sub6            69
  5  Ayoung       sub5            78
y 1   Billy       sub2            89
  2   Brian       sub4            80
  3    Bran       sub3            79
  4   Bryce       sub6            97
  5   Betty       sub5            88

In [21]:
temp['subject_id']['x']

1    sub1
2    sub2
3    sub4
4    sub6
5    sub5
Name: subject_id, dtype: object

In [23]:
print (pd.concat([one,two],axis=1))

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

In [24]:
print (one.append(two))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

### Pivoting

In [25]:
test_frame = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print(test_frame)

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [26]:
stack_frame = test_frame.stack()
print(stack_frame)

0  id                1
   Name          Billy
   subject_id     sub2
1  id                2
   Name          Brian
   subject_id     sub4
2  id                3
   Name           Bran
   subject_id     sub3
3  id                4
   Name          Bryce
   subject_id     sub6
4  id                5
   Name          Betty
   subject_id     sub5
dtype: object

In [33]:
unstack_frame = stack_frame.unstack()
print(unstack_frame)

  id   Name subject_id
0  1  Billy       sub2
1  2  Brian       sub4
2  3   Bran       sub3
3  4  Bryce       sub6
4  5  Betty       sub5

### Removing Entries

In [29]:
unstack_frame.drop(0)

  id   Name subject_id
1  2  Brian       sub4
2  3   Bran       sub3
3  4  Bryce       sub6
4  5  Betty       sub5

In [34]:
unstack_frame.drop('subject_id', axis=1, inplace=True)
unstack_frame

  id   Name
0  1  Billy
1  2  Brian
2  3   Bran
3  4  Bryce
4  5  Betty

### Duplicate Entries

In [36]:
dframe = pd.DataFrame({ 'color': ['pink','yellow','black','red','red', 'pink'],
... 'fea_1': [1,3,5,7,7,1], 'fea_2': [0.2,0.33,0.41,0.45,0.45,0.25]})
dframe

    color  fea_1  fea_2
0    pink      1   0.20
1  yellow      3   0.33
2   black      5   0.41
3     red      7   0.45
4     red      7   0.45
5    pink      1   0.25

In [37]:
print(dframe.duplicated())

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [38]:
print(dframe[dframe.duplicated()])

  color  fea_1  fea_2
4   red      7   0.45

### Replacing Entries

In [44]:
frame = pd.DataFrame({ 'item':['ball', 'mug', 'pencil', 'pen', 'tray'],
... 'color':['blue','rosso','verde','purple','orange'],
'price':[1,3,4,7,9]})
print(frame)

     item   color  price
0    ball    blue      1
1     mug   rosso      3
2  pencil   verde      4
3     pen  purple      7
4    tray  orange      9

In [49]:
newcolors = {
... 'rosso': 'pink',
... 'verde': 'yellow'
... ''}

In [50]:
print(frame.replace(newcolors))

     item   color  price
0    ball    blue      1
1     mug    pink      3
2  pencil  yellow      4
3     pen  purple      7
4    tray  orange      9

In [51]:
import pandas as pd
import numpy as np
ser = pd.Series([1,3,np.nan,4,6,np.nan,3])
print(ser.replace(np.nan,0))

0    1.0
1    3.0
2    0.0
3    4.0
4    6.0
5    0.0
6    3.0
dtype: float64

### Missing Data

Missing data is always a problem in real life scenarios. Areas like machine learning and data mining face severe issues in the accuracy of their model predictions because of poor quality of data caused by missing values. 
In these areas, missing value treatment is a major point of focus to make their models more accurate and valid.

In [52]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a  0.043599  2.145814 -0.843666
b       NaN       NaN       NaN
c -1.081407 -0.959529 -1.841751
d       NaN       NaN       NaN
e -0.344998  0.095623 -1.078711
f -0.437898  1.045425 -1.641137
g       NaN       NaN       NaN
h -1.134015 -0.671143  0.086363

In [53]:
#Check for Missing Values
print (df['one'].isnull())
print (df['one'].notnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [54]:
#Cleaning / Filling Missing Data
print (df.fillna(0))

        one       two     three
a  0.043599  2.145814 -0.843666
b  0.000000  0.000000  0.000000
c -1.081407 -0.959529 -1.841751
d  0.000000  0.000000  0.000000
e -0.344998  0.095623 -1.078711
f -0.437898  1.045425 -1.641137
g  0.000000  0.000000  0.000000
h -1.134015 -0.671143  0.086363

In [55]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

In [56]:
df.head()

        one       two     three
a -0.193098  0.404311 -0.558560
c -0.239552  0.683608 -0.541736
e -1.612438 -0.256218 -0.546365
f -1.301582 -0.818362  0.643017
h  0.087113  0.399983  1.648337

In [57]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a -0.193098  0.404311 -0.558560
b       NaN       NaN       NaN
c -0.239552  0.683608 -0.541736
d       NaN       NaN       NaN
e -1.612438 -0.256218 -0.546365
f -1.301582 -0.818362  0.643017
g       NaN       NaN       NaN
h  0.087113  0.399983  1.648337

In [58]:
print (df.dropna())

        one       two     three
a -0.193098  0.404311 -0.558560
c -0.239552  0.683608 -0.541736
e -1.612438 -0.256218 -0.546365
f -1.301582 -0.818362  0.643017
h  0.087113  0.399983  1.648337

In [59]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a  0.036366  0.174963  0.270598
b       NaN       NaN       NaN
c -0.201139  0.505956 -0.730308
d       NaN       NaN       NaN
e  0.833771 -0.491393  0.521102
f  0.070988  1.016455  0.142657
g       NaN       NaN       NaN
h -1.567391  0.218491  0.004695

In [60]:
df.mean()

one     -0.165481
two      0.284894
three    0.041749
dtype: float64

In [61]:
df.fillna(df.mean())

        one       two     three
a  0.036366  0.174963  0.270598
b -0.165481  0.284894  0.041749
c -0.201139  0.505956 -0.730308
d -0.165481  0.284894  0.041749
e  0.833771 -0.491393  0.521102
f  0.070988  1.016455  0.142657
g -0.165481  0.284894  0.041749
h -1.567391  0.218491  0.004695